{
    "bot": {
        "description": "Hey! I will help you manage your favourite stickers. I can create sticker sets, save stickers to them (or delete them), and assign emoji to stickers.\n\nI work with both still and moving stickers. As far as I'm aware, I'm the only Telegram sticker-managing bot which can save both static and animated stickers into one single sticker set.\n\nPlease tap a button below to start, and I will tell you more about what I'm useful for.",
        "about": "I will help you manage your stickers. Please drop @mrGauz or @danielbilyk a line in case I misbehave.\nIf you want to know a bit more, please have a look at the channel: https://t.me/vorishkachannel",
        "my_sets_desc": "Manage your sets",
        "subscription_desc": "Manage your PROscription",
        "translate_desc": "Change language",
        "help_decs": "Get some help",
        "default_video_set_name": "My stickers",
        "start_command": "Alrighty, thanks for being here.\n\nFirst things first, send me an image or a Telegram sticker, and I'll save it into your personal sticker set for you.\n\nApart from it, here's an overview of what I can do.\n🤖 In the <i>free</i> version:· Save <i>still</i> images and Telegram stickers into personal sticker set.\n· Assign emoji to stickers.\n· Create, rename and delete as many sticker sets as you want.\n· Move your stickers between them.\n👾 In the <i>paid</i> version (available via /subscription):\n· Everything included in the free version.\n· But with animated stickers and videos too.\n\nAs far as I'm aware, I'm the only Telegram sticker-managing bot which can save both static and animated stickers into one single sticker set for your convenience. But you might not need it now, so, as said, just send me an image or a Telegram sticker, and you'll be good to go.",
        "help_command": "You got lost or need a hand. That happens to all of us. Here's what's I can do:\n· I save images and other Telegram stickers to your personal sticker set.\n· In the free version, I support still images and stickers.\n· In the paid version – animated stickers, gifs, and videos (up to 3 seconds).\n· To move or delete a sticker, or to change its emoji, send me the sticker from your personal sticker set.\n\nHere's what the commands do:\n· via /my_sets command you can manage your sticker sets, such as rename or delete them, or create a new one. Mind you, new sets can be created automatically (when it's your first, or when a set became full), or manually when you move a sticker to a new set.\n· via /subscription you can manage your PROscription: obtain it, or add more extra days to it.\n· via /translate you can change the language I'll be talking to you in.\n\nIn case you need further assistance, please contact @danielbilyk or @MrGauz.",
        "cancel_command": "Action canceled.",
        "choose_language": "What language should I speak?",
        "language_changed": "Alrighty, English it is."
    },
    "keyboards": {
        "cancel": "Cancel action",
        "rename_set": "Rename set",
        "delete_set": "Delete set",
        "delete_set_no": "Nope, nevermind",
        "delete_set_yes": "Yes, I want it gone",
        "subscribe": "Get PROscription",
        "change_emoji": "Change emoji",
        "delete_sticker": "Delete sticker",
        "move_sticker": "Move sticker",
        "new_set": "Create new set"
    },
    "errors": {
        "unsupported_update": "Sorry, I can't process whatever this is.",
        "ffmpeg_failed": "Task failed successfully. Please contact @MrGauz for support.",
        "no_sets": "You haven't got any sets yet.\n\nSend me an image or a sticker and I'll create a sticker set for you.",
        "no_group_chats": "Sorry, I'd like your conversation to remain private. <a href='https://t.me/VorishkaStickersBot'>Send me a dm</a>.",
        "unknown_document_type": "Sorry, I can't process this document type yet.",
        "file_too_big": "Sorry, this file is too big (max 20 MB).",
        "not_subscribed": "Saving an animated media as a sticker requires an active PROscription. Please type /subscription to get one.",
        "tgs_converter_failed": "Task failed successfully. Please contact @MrGauz for support.",
        "sticker_not_moved": "Sorry, I couldn't move the sticker. Please try again later.",
        "sticker_not_deleted": "Sorry, I couldn't delete the sticker. Please try again later.",
        "set_not_deleted": "Sorry, I couldn't delete the sticker set {set_title}. Please try again later.",
        "invalid_emoji": "Hm, this seems to be an invalid emoji. Please try again (or send /cancel to abort).",
        "emoji_not_changed": "Sorry, I couldn't change the emoji. Please try again later.",
        "set_not_renamed": "Sorry, I couldn't rename the set to {new_name}.",
        "takes_time_warning": "I'm on it, but it might take a while. I'll let you know when I'm done.",
        "some_telegram_error": "Task failed successfully. Please try again later.",
        "invoice_generation": "I couldn't generate an invoice for you. Please try again later.",
        "pre_checkout_query_failed": "I couldn't process your payment. Please try again later.",
        "sticker_not_saved": "I couldn't save the sticker. Please try again later.",
        "move_set_full": "Sorry, this set is full. Please choose another one."
    },
    "sets": {
        "my_sets_list": "Here are your sets:",
        "first_set_created": "Congratulations, you've just created your first sticker set! It's called <a href='https://t.me/addstickers/{set_name}'>{set_title}</a>. Don't forget to save it.\n\nNow you can rename the set, or delete it altogether, if all of it was a mistake. Just run the /my_sets command to do so.",
        "new_set_created": "Congratulations on a new sticker set! It's called <a href='https://t.me/addstickers/{set_name}'>{set_title}</a>. Don't forget to save it.\n\nBy running the /my_sets command, you can rename the set, or delete it altogether if you created it by mistake.",
        "summary_message": "Set: <a href='https://t.me/addstickers/{set_name}'>{set_title}</a>\nStickers saved: {sticker_count}/50",
        "choose_new_name": "Choose a new name for your set (or send /cancel to abort):",
        "renamed": "I renamed the set to <a href='https://t.me/addstickers/{set_name}'>{new_title}</a>.",
        "confirm_delete": "Are you sure you want to delete <a href='https://t.me/addstickers/{set_name}'>{set_title}</a>? Once it's gone, it's gone forever.",
        "deleted": "Alrighty, I deleted the \"{set_title}\" set.",
        "full_warning": "This is the last sticker I'm saving here, the set is full now. You can delete some unused stickers to make room for new ones. Otherwise, I will create a new one the next time."
    },
    "stickers": {
        "summary_message": "Emoji: {emoji}\nSet: <a href='https://t.me/addstickers/{set_name}'>{set_title}</a>",
        "new_saved": "Job done.\n\nHere's the info about the sticker:\n· Sticker set: <a href='https://t.me/addstickers/{set_name}'>{set_title}</a>\n· Emoji: \" {emoji} \".\n\nIf you'd like to change an emoji behind it, or move it to a different set, just send me the sticker again. Just please make sure you send it from your personal sticker set.",
        "choose_new_emoji": "Choose a new emoji for this sticker (or send /cancel to abort):",
        "emoji_changed": "I changed the emoji to {new_emoji}.",
        "choose_set_to_move": "Choose a set to move the sticker to:",
        "moved": "Sticker was moved to <a href='https://t.me/addstickers/{set_name}'>{set_title}</a>.",
        "confirm_delete": "Are you sure you want to delete this sticker?",
        "deleted": "Alrighty, I deleted the sticker.",
        "last_sticker_deleted": "Since it was the last sticker in the set \"{set_title}\", I deleted the set as well."
    },
    "subscription": {
        "invoice_title": "PROscription",
        "invoice_description": "PROscribe to get access to all the features. To read terms and conditions of the purchase, look no further than <a href='https://pognali.agency/vorishka/terms.html?lang=en'>right here</a>",
        "not_active": "You don't have an active PROscription.\n\nWhat you get with it is:\n· the option to save animated media as a sticker; \n· keep still and animated media within one sticker set like a ✨pro✨.\n\nPress the button below to get one.",
        "status": "Your PROscription is active until {date}.\n\nWhat you get with it is:\n· the option to save animated media as a sticker; \n· keep still and animated media within one sticker set like a ✨pro✨.\n\nPress the button below to get additional 365 days.",
        "payment_success": "Thank you for your purchase! Your PROscription is active until {date}.",
        "deny_precheckout": "I don't know how you got here, but you can't buy this.",
        "renewal_reminder": "Your PROscription ends in {days_left} days. Run /subscription to renew it.",
        "voucher_activated": "Congratulations, your PROscription is prolonged by {days} days. Use /subscription to learn more.",
        "voucher_already_used": "Good job, you've found an easter egg. But this one was already found and used by someone else."
    }
}
